app/controllers/pins_controller.rb

SELECT "pins".* FROM "pins"
---
  def index
    @pins = Pin.all #creates variable and sets equal to Pin.all; run this in console. @ means it global variable.


SELECT "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @pin = Pin.find(params[:id]) #singluar. runs a method .find passing ID in... try in console!

SELECT "pins".* FROM "pins" WHERE "pins"."user_id" = 4 AND "pins"."id" = ? LIMIT 1  [["id", "11"]]
---
  def edit
    @pin = current_user.pins.find(params[:id])

INSERT INTO "pins" ("created_at", "description", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Fri, 13 Sep 2013 20:26:44 UTC +00:00], ["description", "test123"], ["updated_at", Fri, 13 Sep 2013 20:26:44 UTC +00:00], ["user_id", 4]]
---
  def create
    @pin = current_user.pins.new(params[:pin])

    respond_to do |format|
      if @pin.save #if it works

SELECT "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "pins" SET "description" = 'test123', "updated_at" = '2013-09-05 06:56:53.127758' WHERE "pins"."id" = 1
---
  def update
    @pin = current_user.pins.find(params[:id])

    respond_to do |format|
      if @pin.update_attributes(params[:pin])

SELECT "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "pins" WHERE "pins"."id" = ?  [["id", 2]]
---
  def destroy #almost like show
    @pin = current_user.pins.find(params[:id])
    @pin.destroy